CSI API ETABS v1
cTendonObj.GetDrawingPoint Method
 Retrieves drawing point data - intended for internal use
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDrawingPoint(
	string Name,
	ref int NumberItems,
	ref string[] TendonName,
	ref string[] DrawingPointID,
	ref double[] gx,
	ref double[] gy,
	ref double[] gz,
	eItemType ItemType = eItemType.Objects
)
Function GetDrawingPoint (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef TendonName As String(),
	ByRef DrawingPointID As String(),
	ByRef gx As Double(),
	ByRef gy As Double(),
	ByRef gz As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cTendonObj
Dim Name As String
Dim NumberItems As Integer
Dim TendonName As String()
Dim DrawingPointID As String()
Dim gx As Double()
Dim gy As Double()
Dim gz As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetDrawingPoint(Name,
	NumberItems, TendonName, DrawingPointID,
	gx, gy, gz, ItemType)
int GetDrawingPoint(
	String^ Name,
	int% NumberItems,
	array<String^>^% TendonName,
	array<String^>^% DrawingPointID,
	array<double>^% gx,
	array<double>^% gy,
	array<double>^% gz,
	eItemType ItemType = eItemType::Objects
)
abstract GetDrawingPoint :
        Name : string *
        NumberItems : int byref *
        TendonName : string[] byref *
        DrawingPointID : string[] byref *
        gx : float[] byref *
        gy : float[] byref *
        gz : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing tendon object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of items retrieved for the specified tendon objects, all the retrieved data arrays are dimensioned to this length
TendonName
Type: System.String[]
 The name of the tendon object associated with each value.
DrawingPointID
Type: System.String[]
 The drawing point ID associated with each value
gx
Type: System.Double[]
 Global x value [L]
gy
Type: System.Double[]
 Global y value [L]
gz
Type: System.Double[]
 Global z value [L]
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, data is retrieved for the tendon object specified by the Name item.
 If this item is Group, data is retrieved for all tendon objects in the group specified by the Name item.
 If this item is SelectedObjects, data is retrieved for all selected tendon objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
 Drawing point data may include points from the meshed model not available through GetTendonGeometry(String, Int32, Double[], Double[], Double[], String)
See Also
Reference
cTendonObj Interface
ETABSv1 Namespace